In [91]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [92]:
df = pd.read_csv("C:/Users/duffzord/Documents/R-DEV/FIAP/Projetos/machineLearning/Projects/python-lemonade/Lemonade2016.csv")

In [93]:
df.head()

       Date Location  Lemon  Orange  Temperature  Leaflets  Price
0  7/1/2016     Park     97      67           70      90.0   0.25
1  7/2/2016     Park     98      67           72      90.0   0.25
2  7/3/2016     Park    110      77           71     104.0   0.25
3  7/4/2016    Beach    134      99           76      98.0   0.25
4  7/5/2016    Beach    159     118           78     135.0   0.25

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 7 columns):
Date           31 non-null object
Location       32 non-null object
Lemon          32 non-null int64
Orange         32 non-null int64
Temperature    32 non-null int64
Leaflets       31 non-null float64
Price          32 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.8+ KB

In [95]:
df.describe()

            Lemon      Orange  Temperature    Leaflets      Price
count   32.000000   32.000000    32.000000   31.000000  32.000000
mean   116.156250   80.000000    78.968750  108.548387   0.354687
std     25.823357   21.863211     4.067847   20.117718   0.113137
min     71.000000   42.000000    70.000000   68.000000   0.250000
25%     98.000000   66.750000    77.000000   90.000000   0.250000
50%    113.500000   76.500000    80.500000  108.000000   0.350000
75%    131.750000   95.000000    82.000000  124.000000   0.500000
max    176.000000  129.000000    84.000000  158.000000   0.500000

In [96]:
df.isnull().any()

Date            True
Location       False
Lemon          False
Orange         False
Temperature    False
Leaflets        True
Price          False
dtype: bool

In [97]:
df.isnull().sum()

Date           1
Location       0
Lemon          0
Orange         0
Temperature    0
Leaflets       1
Price          0
dtype: int64

In [98]:
df[df['Date'].isnull()]

  Date Location  Lemon  Orange  Temperature  Leaflets  Price
8  NaN    Beach    123      86           82     113.0   0.25

In [99]:
df[6:11]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
6    7/6/2016    Beach    103      69           82      90.0   0.25
7    7/7/2016    Beach    143     101           81     135.0   0.25
8         NaN    Beach    123      86           82     113.0   0.25
9    7/9/2016    Beach    134      95           80     126.0   0.25
10  7/10/2016    Beach    140      98           82     131.0   0.25

In [100]:
df['Date'].fillna('7/8/2016', inplace = True)

In [101]:
df['Date'][8]

'7/8/2016'

In [103]:
df[df['Leaflets'].isnull()]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
20  7/20/2016     Park     71      42           70       NaN    0.5

In [109]:
df[18:23]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
18  7/18/2016     Park    131      92           81     122.0    0.5
19  7/19/2016     Park    122      85           78     113.0    0.5
20  7/20/2016     Park     71      42           70       NaN    0.5
21  7/21/2016     Park     83      50           77      90.0    0.5
22  7/22/2016     Park    112      75           80     108.0    0.5

In [112]:
df[df['Location'] == 'Park'].mean()['Leaflets'].round(decimals = 0)

109.0

In [119]:
df['Leaflets'].interpolate(inplace = True)

In [122]:
df['Leaflets'] = df['Leaflets'].round(decimals = 0)

In [123]:
df['Leaflets'][20]

102.0

In [102]:
df[lemonade_data.duplicated()]

       Date Location  Lemon  Orange  Temperature  Leaflets  Price
6  7/6/2016    Beach    103      69           82      90.0   0.25

In [124]:
df.drop_duplicates(inplace = True)

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 0 to 31
Data columns (total 7 columns):
Date           31 non-null object
Location       31 non-null object
Lemon          31 non-null int64
Orange         31 non-null int64
Temperature    31 non-null int64
Leaflets       31 non-null float64
Price          31 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.9+ KB